Repository: MeGe707/python-docs-tr
Catalog: using/mac.po
Languages: tr

source: Using Python on a Mac
tr: Mac üzerinde Python Kullanma

source: Author
tr: Yazar

source: Python on a Mac running macOS is in principle very similar to Python on any other Unix platform, but there are a number of additional features such as the IDE and the Package Manager that are worth pointing out.
tr: macOS çalıştıran bir Mac'teki Python, prensipte diğer herhangi bir Unix platformundaki Python'a çok benzer, ancak IDE ve Paket Yöneticisi gibi dikkat çekmeye değer bir dizi ek özellik vardır.

source: Getting and Installing MacPython
tr: MacPython'u Edinme ve Kurma

source: macOS since version 10.8 comes with Python 2.7 pre-installed by Apple. If you wish, you are invited to install the most recent version of Python 3 from the Python website (https://www.python.org). A current "universal binary" build of Python, which runs natively on the Mac's new Intel and legacy PPC CPU's, is available there.
tr: 10.8 sürümünden beri macOS, Apple tarafından Python 2.7 önceden yüklenmiş olarak gelir. Dilerseniz Python web sitesinden (https://www.python.org) Python 3'ün en son sürümünü yüklemeye davetlisiniz. Yerel olarak Mac'in yeni Intel ve eski PPC CPU'larında çalışan geçerli bir "evrensel ikili" Python yapısı burada mevcuttur.

source: What you get after installing is a number of things:
tr: Kurulumdan sonra elde ettiğiniz şey birkaç şey:

source: A :file:`Python 3.9` folder in your :file:`Applications` folder. In here you find IDLE, the development environment that is a standard part of official Python distributions; and PythonLauncher, which handles double-clicking Python scripts from the Finder.
tr: :file:`Applications` klasörünüzde bir :file:`Python 3.9` klasörü. Burada, resmi Python dağıtımlarının standart bir parçası olan geliştirme ortamı IDLE'yi bulabilirsiniz; ve Finder'dan Python scriptlerine çift tıklamayı işleyen PythonLauncher.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall MacPython, you can simply remove these three things. A symlink to the Python executable is placed in /usr/local/bin/.
tr: Python yürütülebilir dosyasını ve kitaplıklarını içeren bir çerçeve :file:`/Library/Frameworks/Python.framework`. Yükleyici, bu konumu kabuk yolunuza ekler. MacPython'u kaldırmak için bu üç şeyi kaldırabilirsiniz. Yürütülebilir Python dosyasına bir sembolik bağlantı /usr/local/bin/ dizinine yerleştirilir.

source: The Apple-provided build of Python is installed in :file:`/System/Library/Frameworks/Python.framework` and :file:`/usr/bin/python`, respectively. You should never modify or delete these, as they are Apple-controlled and are used by Apple- or third-party software. Remember that if you choose to install a newer Python version from python.org, you will have two different but functional Python installations on your computer, so it will be important that your paths and usages are consistent with what you want to do.
tr: Apple tarafından sağlanan Python yapısı, sırasıyla :file:`/System/Library/Frameworks/Python.framework` ve :file:`/usr/bin/python` konumlarına yüklenir. Bunlar Apple tarafından kontrol edildiğinden ve Apple veya üçüncü taraf yazılımlar tarafından kullanıldığından bunları asla değiştirmemeli veya silmemelisiniz. Python.org'dan daha yeni bir Python sürümü kurmayı seçerseniz, bilgisayarınızda iki farklı ancak işlevsel Python kurulumuna sahip olacağınızı unutmayın, bu nedenle yollarınızın ve kullanımlarınızın yapmak istediklerinizle tutarlı olması önemli olacaktır.

source: IDLE includes a help menu that allows you to access Python documentation. If you are completely new to Python you should start reading the tutorial introduction in that document.
tr: IDLE, Python belgelerine erişmenizi sağlayan bir yardım menüsü içerir. Python'da tamamen yeniyseniz, o belgedeki eğitim girişini okumaya başlamalısınız.

source: How to run a Python script
tr: Python scripti nasıl çalıştırılır

source: Your best way to get started with Python on macOS is through the IDLE integrated development environment, see section :ref:`ide` and use the Help menu when the IDE is running.
tr: MacOS'ta Python'a başlamanın en iyi yolu, IDLE tümleşik geliştirme ortamıdır, :ref:`ide` bölümüne bakın ve IDE çalışırken Yardım menüsünü kullanın.

source: If you want to run Python scripts from the Terminal window command line or from the Finder you first need an editor to create your script. macOS comes with a number of standard Unix command line editors, :program:`vim` and :program:`emacs` among them. If you want a more Mac-like editor, :program:`BBEdit` or :program:`TextWrangler` from Bare Bones Software (see http://www.barebones.com/products/bbedit/index.html) are good choices, as is :program:`TextMate` (see https://macromates.com/). Other editors include :program:`Gvim` (http://macvim-dev.github.io/macvim/) and :program:`Aquamacs` (http://aquamacs.org/).
tr: Python scriptlerini Terminal penceresi komut satırından veya Finder'dan çalıştırmak istiyorsanız, scriptinizi oluşturmak için önce bir düzenleyiciye ihtiyacınız vardır. macOS, aralarında :program:`vim` ve :program:`emacs` olmak üzere bir dizi standart Unix komut satırı düzenleyicisiyle birlikte gelir. Daha fazla Mac benzeri bir düzenleyici istiyorsanız, Bare Bones Software'den :program:`BBEdit` veya :program:`TextWrangler` (bkz. http://www.barebones.com/products/bbedit/index.html) iyi seçimlerdir. , olduğu gibi :program:`TextMate` (bkz. https://macromates.com/). Diğer düzenleyiciler şunları içerir:program:`Gvim` (http://macvim-dev.github.io/macvim/) ve :program:`Aquamacs` (http://aquamacs.org/).

source: To run your script from the Terminal window you must make sure that :file:`/usr/local/bin` is in your shell search path.
tr: Komut dosyanızı Terminal penceresinden çalıştırmak için :file:`/usr/local/bin` öğesinin kabuk arama yolunuzda olduğundan emin olmalısınız.

source: To run your script from the Finder you have two options:
tr: Scriptinizi Finder'dan çalıştırmak için iki seçeneğiniz vardır:

source: Drag it to :program:`PythonLauncher`
tr: :program:`PythonLauncher` konumuna sürükleyin

source: Select :program:`PythonLauncher` as the default application to open your script (or any .py script) through the finder Info window and double-click it. :program:`PythonLauncher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its Preferences menu to change things globally.
tr: Betiğinizi (veya herhangi bir .py scriptini) bulucu Bilgi penceresinden açmak için varsayılan uygulama olarak :program:`PythonLauncher`ı seçin ve çift tıklayın. :program:`PythonLauncher`, scriptinizin nasıl başlatılacağını kontrol etmek için çeşitli tercihlere sahiptir. Option-sürükleme, bunları bir çağrı için değiştirmenize veya genel olarak bir şeyleri değiştirmek için Tercihler menüsünü kullanmanıza olanak tanır.

source: Running scripts with a GUI
tr: Komut dosyalarını bir GUI ile çalıştırma

source: Configuration
tr: Yapılandırma

source: Python on macOS honors all standard Unix environment variables such as :envvar:`PYTHONPATH`, but setting these variables for programs started from the Finder is non-standard as the Finder does not read your :file:`.profile` or :file:`.cshrc` at startup. You need to create a file :file:`~/.MacOSX/environment.plist`. See Apple's Technical Document QA1067 for details.
tr: macOS'ta Python, :envvar:`PYTHONPATH` gibi tüm standart Unix ortam değişkenlerini onurlandırır, ancak Finder :file:`.profile` veya :file: dosyanızı okumadığından, Finder'dan başlatılan programlar için bu değişkenleri ayarlamak standart değildir. Başlangıçta `.cshrc`. Bir dosya :file:`~/.MacOSX/environment.plist` oluşturmanız gerekir. Ayrıntılar için Apple'ın Teknik Belgesi QA1067'ye bakın.

source: For more information on installation Python packages in MacPython, see section :ref:`mac-package-manager`.
tr: MacPython'da Python paketlerinin kurulumu hakkında daha fazla bilgi için :ref:`mac-package-manager` bölümüne bakın.

source: The IDE
tr: IDE

source: MacPython ships with the standard IDLE development environment. A good introduction to using IDLE can be found at http://www.hashcollision.org/hkn/python/idle_intro/index.html.
tr: MacPython, standart IDLE geliştirme ortamıyla birlikte gelir. IDLE kullanımına iyi bir giriş http://www.hashcollision.org/hkn/python/idle_intro/index.html adresinde bulunabilir.

source: Installing Additional Python Packages
tr: Ek Python Paketlerini Kurma

source: There are several methods to install additional Python packages:
tr: Ek Python paketleri kurmanın birkaç yöntemi vardır:

source: Packages can be installed via the standard Python distutils mode (``python setup.py install``).
tr: Paketler, standart Python distutils modu (``python setup.py install``) aracılığıyla kurulabilir.

source: Many packages can also be installed via the :program:`setuptools` extension or :program:`pip` wrapper, see https://pip.pypa.io/.
tr: Birçok paket ayrıca :program:`setuptools` uzantısı veya :program:`pip` sarıcı aracılığıyla kurulabilir, bkz. https://pip.pypa.io/.

source: GUI Programming on the Mac
tr: Mac'te GUI Programlama

source: There are several options for building GUI applications on the Mac with Python.
tr: Python ile Mac'te GUI uygulamaları oluşturmak için çeşitli seçenekler vardır.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework, which is the foundation of most modern Mac development. Information on PyObjC is available from https://pypi.org/project/pyobjc/.
tr: *PyObjC*, çoğu modern Mac geliştirmesinin temeli olan Apple'ın Objective-C/Cocoa çerçevesine bağlanan bir Python'dur. PyObjC ile ilgili bilgilere https://pypi.org/project/pyobjc/ adresinden ulaşılabilir.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). An Aqua-native version of Tk is bundled with OS X by Apple, and the latest version can be downloaded and installed from https://www.activestate.com; it can also be built from source.
tr: Standart Python GUI araç seti, platformlar arası Tk araç setine (https://www.tcl.tk) dayalı :mod:`tkinter` şeklindedir. Tk'nin Aqua-native sürümü, Apple tarafından OS X ile birlikte gelir ve en son sürüm https://www.activestate.com adresinden indirilip kurulabilir; kaynaktan da inşa edilebilir.

source: *wxPython* is another popular cross-platform GUI toolkit that runs natively on macOS. Packages and documentation are available from https://www.wxpython.org.
tr: *wxPython*, yerel olarak macOS'ta çalışan başka bir popüler platformlar arası GUI araç takımıdır. Paketler ve belgeler https://www.wxpython.org adresinden edinilebilir.

source: *PyQt* is another popular cross-platform GUI toolkit that runs natively on macOS. More information can be found at https://riverbankcomputing.com/software/pyqt/intro.
tr: *PyQt*, yerel olarak macOS'ta çalışan başka bir popüler platformlar arası GUI araç takımıdır. Daha fazla bilgi https://riverbankcomputing.com/software/pyqt/intro adresinde bulunabilir.

source: Distributing Python Applications on the Mac
tr: Python Uygulamalarının Mac'te Dağıtımı

source: The standard tool for deploying standalone Python applications on the Mac is :program:`py2app`. More information on installing and using py2app can be found at http://undefined.org/python/#py2app.
tr: Mac'te bağımsız Python uygulamalarını dağıtmak için standart araç :program:`py2app` şeklindedir. py2app kurulumu ve kullanımı hakkında daha fazla bilgi http://undefined.org/python/#py2app adresinde bulunabilir.

source: Other Resources
tr: Diğer Kaynaklar

source: The MacPython mailing list is an excellent support resource for Python users and developers on the Mac:
tr: MacPython posta listesi, Mac'teki Python kullanıcıları ve geliştiricileri için mükemmel bir destek kaynağıdır:

source: Another useful resource is the MacPython wiki:
tr: Bir başka yararlı kaynak da MacPython wiki'sidir:
