Repository: MeGe707/python-docs-tr
Catalog: using/unix.po
Languages: tr

source: Using Python on Unix platforms
tr: Unix Platfformlarda Python Kullanımı

source: Getting and installing the latest version of Python
tr: Python'un en son sürümünü edinme ve yükleme

source: On Linux
tr: Linux'ta

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can easily compile the latest version of Python from source.
tr: Python, çoğu Linux dağıtımında önceden kurulu olarak gelir ve diğer tüm dağıtımlarda paket olarak bulunur. Ancak, kullanmak isteyebileceğiniz ve dağıtım paketinizde bulunmayan bazı özellikler vardır. Python'un en son sürümünü kaynaktan kolayca derleyebilirsiniz.

source: In the event that Python doesn't come preinstalled and isn't in the repositories as well, you can easily make packages for your own distro. Have a look at the following links:
tr: Python'un önceden kurulu olarak gelmemesi ve depolarda olmaması durumunda, kendi dağıtımınız için kolayca paketler oluşturabilirsiniz. Aşağıdaki bağlantılara bir göz atın:

source: for Debian users
tr: Debian Kullanıcıları İçin:

source: for OpenSuse users
tr: OpenSuse kullanıcıları için:

source: for Fedora users
tr: Fedora Kullanıcıları İçin:

source: for Slackware users
tr: Slackware Kullanıcıları İçin:

source: On FreeBSD and OpenBSD
tr: FeeBSD ve OpenBSD üzerinde

source: FreeBSD users, to add the package use::
tr: FreeBSD kullanıcıları, paket eklemek için kullanır::

source: OpenBSD users, to add the package use::
tr: OpenBSD kullanıcıları, paket eklemek için kullanır::

source: For example i386 users get the 2.5.1 version of Python using::
tr: Örneğin, i386 kullanıcıları Python'un 2.5.1 sürümünü şunu kullanarak alır::

source: On OpenSolaris
tr: OpenSolaris üzerinde

source: You can get Python from `OpenCSW <https://www.opencsw.org/>`_. Various versions of Python are available and can be installed with e.g. ``pkgutil -i python27``.
tr: Python'u `OpenCSW <https://www.opencsw.org/>` adresinden edinebilirsiniz. Python'un çeşitli sürümleri mevcuttur ve örn. ``pkgutil -i python27``.

source: Building Python
tr: Python'u Builld Etme

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `clone <https://devguide.python.org/setup/#getting-the-source-code>`_. (If you want to contribute patches, you will need a clone.)
tr: CPython'u kendiniz derlemek istiyorsanız, yapmanız gereken ilk şey `kaynak <https://www.python.org/downloads/source/>` almaktır. En son sürümün kaynağını indirebilir veya yeni bir "klon <https://devguide.python.org/setup/#getting-the-source-code>" alabilirsiniz. (Yamalara katkıda bulunmak istiyorsanız, bir klona ihtiyacınız olacaktır.)

source: The build process consists of the usual commands::
tr: Derleme işlemi olağan komutlardan oluşur::

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
tr: Belirli Unix platformları için :ref:`Yapılandırma seçenekleri <configure-options>` ve uyarılar, Python kaynak ağacının kökündeki :source:`README.rst` dosyasında kapsamlı bir şekilde belgelenmiştir.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
tr: ``make install`` :file:`python3` ikilisinin üzerine yazabilir veya maskeleyebilir. Bu nedenle, yalnızca :file:`{exec_prefix}/bin/python{version}` yüklediğinden ``make install`` yerine ``make altinstall`` önerilir.

source: Python-related paths and files
tr: Python ile ilgili yollar ve dosyalar

source: These are subject to difference depending on local installation conventions; :envvar:`prefix` (``${prefix}``) and :envvar:`exec_prefix` (``${exec_prefix}``) are installation-dependent and should be interpreted as for GNU software; they may be the same.
tr: Bunlar, yerel kurulum kurallarına bağlı olarak farklılık gösterebilir; :envvar:`prefix` (``${prefix}``) ve :envvar:`exec_prefix` (``${exec_prefix}``) kuruluma bağlıdır ve GNU yazılımı olarak yorumlanmalıdır; aynı olabilirler.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
tr: Örneğin, çoğu Linux sisteminde, her ikisi için de varsayılan değer :file:`/usr` şeklindedir.

source: File/directory
tr: dosya/dizin

source: Meaning
tr: Anlam

source: Recommended location of the interpreter.
tr: Yorumlayıcı için önerilen konum.

source: Recommended locations of the directories containing the standard modules.
tr: Standart modülleri içeren dizinlerin önerilen konumları.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
tr: Python uzantılarını geliştirmek ve yorumlayıcıyı yerleştirmek için gereken dahil etme dosyalarını içeren dizinlerin önerilen konumları.

source: Miscellaneous
tr: Çeşitli

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
tr: Python scriptlerini Unix'te kolayca kullanmak için, onları yürütülebilir hale getirmeniz gerekir, örn. ile birlikte

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
tr: ve betiğin başına uygun bir Shebang satırı koyun. İyi bir seçim genellikle ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
tr: tüm :envvar:`PATH` içinde Python yorumlayıcısını arar. Ancak, bazı Unice'ler :program:`env` komutuna sahip olmayabilir, bu nedenle yorumlayıcı yolu olarak ``/usr/bin/python3`` kodlamanız gerekebilir.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
tr: Python scriptlerinizde shell komutlarını kullanmak için :mod:`subprocess` modülüne bakın.

source: Custom OpenSSL
tr: Özel OpenSSL

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
tr: Satıcınızın OpenSSL yapılandırmasını ve sistem güven deposunu kullanmak için, ``openssl.cnf`` dosyası veya ``/etc`` içinde sembolik bağlantı içeren dizini bulun. Çoğu dağıtımda dosya ya ``/etc/ssl`` veya ``/etc/pki/tls`` dizinindedir. Dizin ayrıca bir "cert.pem" dosyası ve/veya bir "certs" dizini içermelidir.

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
tr: OpenSSL'yi indirin, oluşturun ve kurun. ``install`` değil, ``install_sw`` kullandığınızdan emin olun. "install_sw" hedefi, "openssl.cnf" dosyasını geçersiz kılmaz.

source: Build Python with custom OpenSSL (see the configure `--with-openssl` and `--with-openssl-rpath` options)
tr: Python'u özel OpenSSL ile derleyin ('--with-openssl' ve '--with-openssl-rpath' seçeneklerini yapılandırmaya bakın)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
tr: OpenSSL'nin yama sürümleri, geriye dönük uyumlu bir ABI'ya sahiptir. OpenSSL'yi güncellemek için Python'u yeniden derlemeniz gerekmez. Özel OpenSSL kurulumunu daha yeni bir sürümle değiştirmek yeterlidir.
